In [1]:
%load_ext sql

In [2]:
import csv,sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('FINALDB.db')
cur = conn.cursor()

In [4]:
%sql sqlite:///FINALDB.db

In [3]:
census_data = pd.read_csv(r'C:\Users\Hp\OneDrive\Desktop\ChicagoCensusData.csv')
chicago_public_schools = pd.read_csv(r'C:\Users\Hp\OneDrive\Desktop\ChicagoPublicSchools.csv')
chicago_crime_data = pd.read_csv(r'C:\Users\Hp\OneDrive\Desktop\ChicagoCrimeData.csv')

In [8]:
census_data.to_sql('CENSUS_DATA', conn, if_exists='replace', index=False) 
chicago_public_schools.to_sql('CHICAGO_PUBLIC_SCHOOLS',conn, if_exists='replace', index=False)
chicago_crime_data.to_sql('CHICAGO_CRIME_DATA',conn, if_exists='replace', index=False)

533

In [9]:
%sql SELECT COUNT(*) FROM CENSUS_DATA;

 * sqlite:///FINALDB.db
Done.

[(78,)]

In [11]:
%sql SELECT COMMUNITY_AREA_NAME, PER_CAPITA_INCOME FROM CENSUS_DATA WHERE PER_CAPITA_INCOME<11000;

 * sqlite:///FINALDB.db
Done.

[('West Garfield Park', 10934),
 ('South Lawndale', 10402),
 ('Fuller Park', 10432),
 ('Riverdale', 8201)]

In [25]:
%sql SELECT CASE_NUMBER FROM CHICAGO_CRIME_DATA WHERE DESCRIPTION LIKE '%MINOR%';

 * sqlite:///FINALDB.db
Done.

[('HL266884',), ('HK238408',)]

In [29]:
%sql SELECT ID, CASE_NUMBER, PRIMARY_TYPE, DESCRIPTION, DATE FROM CHICAGO_CRIME_DATA WHERE PRIMARY_TYPE LIKE '%KIDNAPPING%';

 * sqlite:///FINALDB.db
Done.

[(5276766, 'HN144152', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', '2007-01-26')]

In [37]:
%sql SELECT DISTINCT(PRIMARY_TYPE), DESCRIPTION, LOCATION_DESCRIPTION FROM CHICAGO_CRIME_DATA WHERE LOCATION_DESCRIPTION LIKE '%SCHOOL%';

 * sqlite:///FINALDB.db
Done.

[('BATTERY', 'SIMPLE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('BATTERY', 'PRO EMP HANDS NO/MIN INJURY', 'SCHOOL, PUBLIC, BUILDING'),
 ('BATTERY', 'SIMPLE', 'SCHOOL, PUBLIC, BUILDING'),
 ('CRIMINAL DAMAGE', 'TO VEHICLE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'POSS: HEROIN(WHITE)', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'MANU/DEL:CANNABIS 10GM OR LESS', 'SCHOOL, PUBLIC, BUILDING'),
 ('ASSAULT', 'PRO EMP HANDS NO/MIN INJURY', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL TRESPASS', 'TO LAND', 'SCHOOL, PUBLIC, GROUNDS'),
 ('PUBLIC PEACE VIOLATION', 'BOMB THREAT', 'SCHOOL, PRIVATE, BUILDING'),
 ('PUBLIC PEACE VIOLATION', 'BOMB THREAT', 'SCHOOL, PUBLIC, BUILDING')]

In [44]:
%%sql
SELECT "Elementary, Middle, or High School", AVG(SAFETY_SCORE) AS AVERAGE_SAFETY_SCORE
FROM CHICAGO_PUBLIC_SCHOOLS
GROUP BY "Elementary, Middle, or High School";

 * sqlite:///FINALDB.db
Done.

[('ES', 49.52038369304557), ('HS', 49.62352941176471), ('MS', 48.0)]

In [47]:
%sql SELECT COMMUNITY_AREA_NAME,PERCENT_HOUSEHOLDS_BELOW_POVERTY FROM CENSUS_DATA ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC LIMIT 5;

 * sqlite:///FINALDB.db
Done.

[('Riverdale', 56.5),
 ('Fuller Park', 51.2),
 ('Englewood', 46.6),
 ('North Lawndale', 43.1),
 ('East Garfield Park', 42.4)]

In [53]:
%%sql
SELECT COMMUNITY_AREA_NUMBER ,COUNT(COMMUNITY_AREA_NUMBER) AS FREQUENCY
FROM CHICAGO_CRIME_DATA 
GROUP BY COMMUNITY_AREA_NUMBER
ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC
LIMIT 1;

 * sqlite:///FINALDB.db
Done.

[(25.0, 43)]

In [54]:
%%sql
SELECT COMMUNITY_AREA_NAME FROM CENSUS_DATA
WHERE HARDSHIP_INDEX=
(SELECT MAX(HARDSHIP_INDEX) FROM CENSUS_DATA);

 * sqlite:///FINALDB.db
Done.

[('Riverdale',)]

In [56]:
%%sql
SELECT COMMUNITY_AREA_NAME FROM CENSUS_DATA
WHERE
COMMUNITY_AREA_NUMBER = 
(SELECT COMMUNITY_AREA_NUMBER FROM CHICAGO_CRIME_DATA
 GROUP BY COMMUNITY_AREA_NUMBER
 ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC
  LIMIT 1)
LIMIT 1;

 * sqlite:///FINALDB.db
Done.

[('Austin',)]